Задание 1 Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
ratings = pd.read_csv('ml-25m/ratings.csv')
ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [3]:
ratings[ratings['rating']==5.0]['movieId'].value_counts().head(1)

318    39553
Name: movieId, dtype: int64

In [4]:
ratings[ratings['rating']==5.0]['movieId'].value_counts().to_frame().head(1)

     movieId
318    39553

In [5]:
movies = pd.read_csv('ml-25m/movies.csv')

In [6]:
joined = ratings.merge(movies, on='movieId', how='left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,296,5.0,1147880044,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
1,1,306,3.5,1147868817,Three Colors: Red (Trois couleurs: Rouge) (1994),Drama
2,1,307,5.0,1147868828,Three Colors: Blue (Trois couleurs: Bleu) (1993),Drama
3,1,665,5.0,1147878820,Underground (1995),Comedy|Drama|War
4,1,899,3.5,1147868510,Singin' in the Rain (1952),Comedy|Musical|Romance

In [7]:
joined[joined['rating']==5.0]['title'].value_counts().to_frame().head(1)

                                  title
Shawshank Redemption, The (1994)  39553

Задание 2 По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [8]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [9]:
data[ data['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [10]:
filtered_countries = data[ (data['country']=='Latvia') | (data['country']=='Lithuania') | (data['country']=='Estonia') ]

filtered_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [11]:
filtered_year = filtered_countries[ (filtered_countries['year']>=2005)
                                   & (filtered_countries['year']<=2010)
                                   & (filtered_countries['quantity']>0) ]

filtered_year.head()

       country  year  quantity  category
377  Lithuania  2010     158.0         1
378  Lithuania  2009     158.0         1
379  Lithuania  2008     100.0         1
380  Lithuania  2007     105.0         1
961  Lithuania  2009       3.0         1

In [12]:
filtered_category = filtered_year[ (filtered_year['category']==4)
                                  | (filtered_year['category']==12)
                                  | (filtered_year['category']==21) ]

filtered_category.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4

In [13]:
total_consumption = filtered_category['quantity'].sum()
print(f'Суммарное потребление стран Прибалтики {total_consumption}')

Суммарное потребление стран Прибалтики 240580.0

Задание 3 Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe. Примеры страниц (необязательно брать именно эти): https://fortrader.org/quotes www.finanz.ru...om-vremeni

In [14]:
pd.read_html('https://www.championat.com/football/_euro.html', encoding='utf-8')[1]

   №    Команда  Игры  Очки  Проход
0  1    Бельгия     2     6     NaN
1  2     Россия     2     3     NaN
2  3  Финляндия     2     3     NaN
3  4      Дания     2     0     NaN